EnryGentile/Embedded-Secure-Gate-Controller/src/Remote_Controller/x-cube-subg1_firmware/STM32CubeExpansion_SUBG1_V3.3.0/Drivers/BSP/Components/S2LP/S2LP_Library/Inc/S2LP_Regs.h
/**
 * @file S2LP_Regs.h
 * @author  LowPower RF BU - AMG
 * @version 1.3.0
 * @date    10-July-2017
 * @brief This file  contains all the registers address and masks.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2019 STMicroelectronics</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors 
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * <h2><center>&copy; COPYRIGHT 2019 STMicroelectronics</center></h2>
 */



/**
 * \brief GPIO0_CONF register
 * \code
 * Read and Write
 * Default value: 0x0A
 * 7:3 GPIO_SELECT: Specify the GPIO0 I/O signal, default setting POR.
 * 2 RESERVED: -
 * 1:0 GPIO_MODE: GPIO0 Mode:,  01b: Digital Input,  10b: Digital Output Low Power,  11b: Digital Output High Power
 * \endcode
 */
#define GPIO0_CONF_ADDR			((uint8_t)0x00)

#define GPIO_SELECT_REGMASK			((uint8_t)0xF8)
#define GPIO_MODE_REGMASK			((uint8_t)0x03)


/**
 * \brief GPIO1_CONF register
 * \code
 * Read and Write
 * Default value: 0xA2
 * 7:3 GPIO_SELECT: Specify the GPIO1 I/O signal, default setting digital GND.
 * 2 RESERVED: -
 * 1:0 GPIO_MODE: GPIO1 Mode:,  01b: Digital Input1,  0b: Digital Output Low Power,  11b: Digital Output High Power
 * \endcode
 */
#define GPIO1_CONF_ADDR			((uint8_t)0x01)

#define GPIO_SELECT_REGMASK			((uint8_t)0xF8)
#define GPIO_MODE_REGMASK			((uint8_t)0x03)


/**
 * \brief GPIO2_CONF register
 * \code
 * Read and Write
 * Default value: 0xA2
 * 7:3 GPIO_SELECT: Specify the GPIO2 I/O signal, default setting digital GND.
 * 2 RESERVED: -
 * 1:0 GPIO_MODE: GPIO2 Mode:,  01b: Digital Input,  10b: Digital Output Low Power,  11b: Digital Output High Power
 * \endcode
 */
#define GPIO2_CONF_ADDR			((uint8_t)0x02)

#define GPIO_SELECT_REGMASK			((uint8_t)0xF8)
#define GPIO_MODE_REGMASK			((uint8_t)0x03)


/**
 * \brief GPIO3_CONF register
 * \code
 * Read and Write
 * Default value: 0xA2
 * 7:3 GPIO_SELECT: Specify the GPIO3 I/O signal, default setting digital GND.
 * 2 RESERVED: -
 * 1:0 GPIO_MODE: GPIO3 Mode:,  00b: Analog,  01b: Digital Input,  10b: Digital Output Low Power,  11b: Digital Output High Power
 * \endcode
 */
#define GPIO3_CONF_ADDR			((uint8_t)0x03)

#define GPIO_SELECT_REGMASK			((uint8_t)0xF8)
#define GPIO_MODE_REGMASK			((uint8_t)0x03)


/**
 * \brief MCU_CK_CONF register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7 EN_MCU_CLK: 1: The internal divider logic is running, so the MCU clock is available (but proper GPIO configuration is needed)
 * 6:5 CLOCK_TAIL: Number of extra clock cycles provided to the MCU before switching to STANDBY state.,  00b: 0 extra clock cycle,  01b: 64 extra clock cycles,  10b: 256 extra clock cycles,  11b: 512 extra clock cycles
 * 4:1 XO_RATIO: Divider for the XO clock output
 * 0 RCO_RATIO: Divider for the RCO clock output,  0: 1 , 1: 1/128
 * \endcode
 */
#define MCU_CK_CONF_ADDR			((uint8_t)0x04)

#define EN_MCU_CLK_REGMASK			((uint8_t)0x80)
#define CLOCK_TAIL_REGMASK			((uint8_t)0x60)
#define XO_RATIO_REGMASK			((uint8_t)0x1E)
#define RCO_RATIO_REGMASK			((uint8_t)0x01)


/**
 * \brief SYNT3 register
 * \code
 * Read and Write
 * Default value: 0x42
 * 7:5 PLL_CP_ISEL: Set the charge pump current according to the XTAL frequency.
 * 4 BS: Synthesizer band select. This parameter selects the out-of loop divide factor of the synthesizer:,  0: 4, band select factor for high band,  1: 8, band select factor for middle band.
 * 3:0 SYNT_27_24: MSB bits of the PLL programmable divider.
 * \endcode
 */
#define SYNT3_ADDR			((uint8_t)0x05)

#define PLL_CP_ISEL_REGMASK			((uint8_t)0xE0)
#define BS_REGMASK			((uint8_t)0x10)
#define SYNT_27_24_REGMASK			((uint8_t)0x0F)


/**
 * \brief SYNT2 register
 * \code
 * Read and Write
 * Default value: 0x16
 * 7:0 SYNT[23:16]: Intermediate bits of the PLL programmable divider.
 * \endcode
 */
#define SYNT2_ADDR			((uint8_t)0x06)

#define SYNT_23_16_REGMASK			((uint8_t)0xFF)


/**
 * \brief SYNT1 register
 * \code
 * Read and Write
 * Default value: 0x27
 * 7:0 SYNT[15:8]: Intermediate bits of the PLL programmable divider.
 * \endcode
 */
#define SYNT1_ADDR			((uint8_t)0x07)

#define SYNT_15_8_REGMASK			((uint8_t)0xFF)


/**
 * \brief SYNT0 register
 * \code
 * Read and Write
 * Default value: 0x62
 * 7:0 SYNT[7:0]: LSB bits of the PLL programmable divider.
 * \endcode
 */
#define SYNT0_ADDR			((uint8_t)0x08)

#define SYNT_7_0_REGMASK			((uint8_t)0xFF)


/**
 * \brief IF_OFFSET_ANA register
 * \code
 * Read and Write
 * Default value: 0x2A
 * 7:0 IF_OFFSET_ANA: Intermediate frequency setting for the analog RF synthesizer, default: 300 kHz.
 * \endcode
 */
#define IF_OFFSET_ANA_ADDR			((uint8_t)0x09)

