EnryGentile/Embedded-Secure-Gate-Controller/src/Remote_Controller/x-cube-subg1_firmware/STM32CubeExpansion_SUBG1_V3.3.0/Drivers/BSP/Components/S2LP/S2LP_Library/Inc/S2LP_Regs.h
#define BATTERY_LVL_EN_REGMASK			((uint8_t)0x40)
#define SET_BLD_TH_REGMASK			((uint8_t)0x30)


/**
 * \brief PM_CONF0 register
 * \code
 * Read and Write
 * Default value: 0x42
 * 7 RESERVED: -
 * 6:4 SET_SMPS_LVL: 000: SMPS output voltage 1.1 V, 001: SMPS output voltage 1.2 V, 010: SMPS output voltage 1.3 V, 011: SMPS output voltage 1.4 V, 100: SMPS output voltage 1.5 V, 101: SMPS output voltage 1.6 V, 110: SMPS output voltage 1.7 V, 111: SMPS output voltage 1.8 V.
 * 3:2 RESERVED: -
 * 1 RESERVED: -
 * 0 SLEEP_MODE_SEL: 0: SLEEP without FIFO retention; 1: SLEEP with FIFO retention.
 * \endcode
 */
#define PM_CONF0_ADDR			((uint8_t)0x79)

#define SET_SMPS_LVL_REGMASK			((uint8_t)0x70)
#define SLEEP_MODE_SEL_REGMASK			((uint8_t)0x01)


/**
 * \brief MC_STATE1 register
 * \code
 * Read only
 * Default value: 0x52
 * 7:5 RESERVED: -
 * 4 RCO_CAL_OK: RCO calibration succesfully terminated.
 * 3 ANT_SEL: Currently selected antenna.
 * 2 TX_FIFO_FULL: 1: TX FIFO is full.
 * 1 RX_FIFO_EMPTY: 1: RX FIFO is empty.
 * 0 ERROR_LOCK: 1: RCO calibrator error.
 * \endcode
 */
#define MC_STATE1_ADDR			((uint8_t)0x8D)

#define RCO_CAL_OK_REGMASK			((uint8_t)0x10)
#define ANT_SEL_REGMASK			((uint8_t)0x08)
#define TX_FIFO_FULL_REGMASK			((uint8_t)0x04)
#define RX_FIFO_EMPTY_REGMASK			((uint8_t)0x02)
#define ERROR_LOCK_REGMASK			((uint8_t)0x01)


/**
 * \brief MC_STATE0 register
 * \code
 * Read only
 * Default value: 0x07
 * 7:1 STATE: Current state.
 * 0 XO_ON: 1: XO is operating.
 * \endcode
 */
#define MC_STATE0_ADDR			((uint8_t)0x8E)

#define STATE_REGMASK			((uint8_t)0xFE)
#define XO_ON_REGMASK			((uint8_t)0x01)


/**
 * \brief TX_FIFO_STATUS register
 * \code
 * Read only
 * Default value: 0x00
 * 7 RESERVED: -
 * 6:0 NELEM_TXFIFO: Number of elements in TX FIFO.
 * \endcode
 */
#define TX_FIFO_STATUS_ADDR			((uint8_t)0x8F)

#define NELEM_TXFIFO_REGMASK			((uint8_t)0x7F)


/**
 * \brief RX_FIFO_STATUS register
 * \code
 * Read only
 * Default value: 0x00
 * 7 RESERVED: -
 * 6:0 NELEM_RXFIFO: Number of elements in RX FIFO.
 * \endcode
 */
#define RX_FIFO_STATUS_ADDR			((uint8_t)0x90)

#define NELEM_RXFIFO_REGMASK			((uint8_t)0x7F)


/**
 * \brief RCO_CALIBR_OUT4 register
 * \code
 * Read only
 * Default value: 0x70
 * 7:4 RWT_OUT: RWT word from internal RCO calibrator.
 * 3:0 RFB_OUT_4_1: RFT word (MSB) from internal RCO calibrator.
 * \endcode
 */
#define RCO_CALIBR_OUT4_ADDR			((uint8_t)0x94)

#define RWT_OUT_REGMASK			((uint8_t)0xF0)
#define RFB_OUT_4_1_REGMASK			((uint8_t)0x0F)


/**
 * \brief RCO_CALIBR_OUT3 register
 * \code
 * Read only
 * Default value: 0x00
 * 7 RFB_OUT[0]: RFT word (LSB) from internal RCO calibrator.
 * 6:0 RESERVED: -
 * \endcode
 */
#define RCO_CALIBR_OUT3_ADDR			((uint8_t)0x95)

#define RFB_OUT_0_REGMASK			((uint8_t)0x80)


/**
 * \brief VCO_CALIBR_OUT1 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:4 RESERVED: -
 * 3:0 VCO_CAL_AMP_OUT: VCO magnitude calibration output word (binary coding internally converted from thermometric coding).
 * \endcode
 */
#define VCO_CALIBR_OUT1_ADDR			((uint8_t)0x99)

#define VCO_CAL_AMP_OUT_REGMASK			((uint8_t)0x0F)


/**
 * \brief VCO_CALIBR_OUT0 register
 * \code
 * Read only
 * Default value: 0x00
 * 7 RESERVED: -
 * 6:0 VCO_CAL_FREQ_OUT: VCO Cbank frequency calibration output word (binary coding internally converted from thermometric coding).
 * \endcode
 */
#define VCO_CALIBR_OUT0_ADDR			((uint8_t)0x9A)

#define VCO_CAL_FREQ_OUT_REGMASK			((uint8_t)0x7F)


/**
 * \brief TX_PCKT_INFO register
 * \code
 * Read only
 * Default value: 0x00
 * 7:6 RESERVED: -
 * 5:4 TX_SEQ_NUM: Current TX packet sequence number.
 * 3:0 N_RETX: Number of re-transmissions done for the last TX packet.
 * \endcode
 */
#define TX_PCKT_INFO_ADDR			((uint8_t)0x9C)

#define TX_SEQ_NUM_REGMASK			((uint8_t)0x30)
#define N_RETX_REGMASK			((uint8_t)0x0F)


/**
 * \brief RX_PCKT_INFO register
 * \code
 * Read only
 * Default value: 0x00
 * 7:3 RESERVED: -
 * 2 NACK_RX: NACK field of the received packet.
 * 1:0 RX_SEQ_NUM: Sequence number of the received packet.
 * \endcode
 */
#define RX_PCKT_INFO_ADDR			((uint8_t)0x9D)

#define NACK_RX_REGMASK			((uint8_t)0x04)
#define RX_SEQ_NUM_REGMASK			((uint8_t)0x03)


/**
 * \brief AFC_CORR register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 AFC_CORR: AFC corrected value.
 * \endcode
 */
#define AFC_CORR_ADDR			((uint8_t)0x9E)

#define AFC_CORR_REGMASK			((uint8_t)0xFF)


/**
 * \brief LINK_QUALIF2 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 PQI: PQI value of the received packet.
 * \endcode
 */
#define LINK_QUALIF2_ADDR			((uint8_t)0x9F)

#define PQI_REGMASK			((uint8_t)0xFF)


/**
 * \brief LINK_QUALIF1 register
 * \code
 * Read only
 * Default value: 0x00
 * 7 CS: Carrier Sense indication.
 * 6:0 SQI: SQI value of the recived packet.
 * \endcode
 */
#define LINK_QUALIF1_ADDR			((uint8_t)0xA0)

#define CS_REGMASK			((uint8_t)0x80)
#define SQI_REGMASK			((uint8_t)0x7F)


/**
 * \brief RSSI_LEVEL register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 RSSI_LEVEL: RSSI level captured at the end of the SYNC word detection of the received packet.
 * \endcode
 */
#define RSSI_LEVEL_ADDR			((uint8_t)0xA2)

#define RSSI_LEVEL_REGMASK			((uint8_t)0xFF)


/**
 * \brief RX_PCKT_LEN1 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 RX_PCKT_LEN[14:8]: MSB valueof the length of the packet received.
 * \endcode
 */
#define RX_PCKT_LEN1_ADDR			((uint8_t)0xA4)

#define RX_PCKT_LEN_14_8_REGMASK			((uint8_t)0xFF)


/**
 * \brief RX_PCKT_LEN0 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 RX_PCKT_LEN[7:0]: LSB valueof the length of the packet received.
 * \endcode
 */
#define RX_PCKT_LEN0_ADDR			((uint8_t)0xA5)

#define RX_PCKT_LEN_7_0_REGMASK			((uint8_t)0xFF)


/**
 * \brief CRC_FIELD3 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 CRC_FIELD3: CRC field 3 of the received packet.
 * \endcode
 */
#define CRC_FIELD3_ADDR			((uint8_t)0xA6)

#define CRC_FIELD3_REGMASK			((uint8_t)0xFF)


/**
 * \brief CRC_FIELD2 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 CRC_FIELD2: CRC field 2 of the received packet.
 * \endcode
 */
#define CRC_FIELD2_ADDR			((uint8_t)0xA7)

#define CRC_FIELD2_REGMASK			((uint8_t)0xFF)


/**
 * \brief CRC_FIELD1 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 CRC_FIELD1: CRC field 1 of the received packet.
 * \endcode
 */
#define CRC_FIELD1_ADDR			((uint8_t)0xA8)

#define CRC_FIELD1_REGMASK			((uint8_t)0xFF)


/**
 * \brief CRC_FIELD0 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 CRC_FIELD0: CRC field 0 of the received packet.
 * \endcode
 */
#define CRC_FIELD0_ADDR			((uint8_t)0xA9)

